Project/Toir.Adaptation/src/InformationRegisters/торо_ИерархическиеСтруктурыОР/торо_ИерархическиеСтруктурыОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ИерархическиеСтруктурыОР</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ecf4614a-f3c8-44c8-9355-8a406a840ca5">
    <name>РодительИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="c4d866bf-46bc-412c-b7cf-a88074622812">
    <name>ОбъектИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7f327261-9505-4dcb-bf45-cd6eb8ce0242">
    <name>СтруктураИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_РасположениеОРВСтруктуреИерархии/торо_РасположениеОРВСтруктуреИерархии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="774db338-91f2-4ead-8895-fd51f145458a">
  <name>торо_РасположениеОРВСтруктуреИерархии</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="d8481881-51b9-4962-8b6c-bfa78e30e457">
    <name>РодительИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="2c99b177-de41-496b-bfc8-0cd1b039671a">
    <name>Удален</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="280e0fd3-b182-49f3-abd2-2c4247cfe274">
    <name>ОбъектИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6bc5297f-c3fd-4ba2-ad6f-c69875395c47">
    <name>СтруктураИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ЗначенияКонтролируемыхПоказателей/торо_ЗначенияКонтролируемыхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ЗначенияКонтролируемыхПоказателей</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Показатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ДатаКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Enums/торо_ТипыОбъектовRCM/торо_ТипыОбъектовRCM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c3d8e035-da50-4f13-96f3-fb3612d91d8b">
  <name>торо_ТипыОбъектовRCM</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f02e4c26-aca8-4efa-8aef-cef78c903dd7">
    <name>ФункциональноеМесто</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/Documents/торо_УчетКонтролируемыхПоказателей/торо_УчетКонтролируемыхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_УчетКонтролируемыхПоказателей</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.торо_ЗначенияКонтролируемыхПоказателей</registerRecords>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="17acea66-f6c9-487b-a647-e9cc33ee27ab">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="d76ccf21-2b19-452e-9028-4edb77481e00">
    <name>Показатели</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/Catalogs/торо_ОбъектыРемонта/торо_ОбъектыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bc7402bd-d283-40c7-9b61-dde80fafb3d8">
  <name>торо_ОбъектыРемонта</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="47be0c3c-665b-4830-8574-be2cb00622d6">
    <name>НомерПаспорта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5959fb7d-0181-4005-b007-cc40a2b7939c">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8251a1bd-d678-4dbc-bd21-6454cb89086e">
    <name>УсловиеРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="934cd87a-75d4-4f33-b94c-1a7268168b99">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e8bc213a-2aad-4ac9-a27a-66bbeba601f7">
    <name>ВестиУчетСерийныхЗапчастей</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b3a58cb8-2443-4009-b5f6-f4cb4f657cb7">
    <name>ИнвентарныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="137abfc3-93b5-4dba-b32d-cd523dd8a9d9">
    <name>ДоговорКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="708b732b-9137-43b3-a14b-3163cb9aadb2">
    <name>КонтрагентИсполнительРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e6a133e9-f30d-4180-b92c-26930eaeb626">
    <name>АдресМестонахождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c0b40a8f-b23e-4ea3-8c69-401d995aed0a">
    <name>ВнешнийОбъект</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ea3c21ff-2af7-4916-a866-e5b01c2fea11">
    <name>ДатаВводаВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bc8196e3-5978-482f-b439-7243b365e6ef">
    <name>НеУчаствуетВПланировании</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b5ba0323-3b01-46d2-9bde-8c0207e1cb21">
    <name>ДатаВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eebb6ad6-7b6c-4e39-8fe5-992da135c1dd">
    <name>ТехНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="db977b56-8d4f-477d-bacd-96c656f0c4e2">
    <name>ЗаводскойНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="47fb0293-feaf-4992-8644-4f79efbe139f">
    <name>Изготовитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d385af4b-7522-4ee2-90b0-42e45425d027">
    <name>КодОР</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="83487b6e-133f-4515-acf1-81c067f764b5">
    <name>КодПоОКОФ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6408b474-ecee-4541-9bde-b1f79b146a49">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="411d399d-7893-49c5-833d-49f4491aff6b">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f389921f-a031-4484-9e7c-211c9ff6f3cf">
    <name>ПлановыйГрафикРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0b0e085f-b80a-45ba-8729-f3d02e881457">
    <name>Направление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37be55ce-a45f-4bcb-811a-1111b86c4734">
    <name>ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="94e46aa7-60a7-4a2b-b803-57b6770dd6b9">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c298ffb9-2689-44d1-8554-0f498c0e29f0">
    <name>СрокПолезногоИспользования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="213a88d1-10cd-4415-be87-6466d619cd88">
    <name>ТиповойОР</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3bf26677-1440-4003-bb01-95200a087f95">
    <name>ЭтоАктив</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="33da016d-23b6-4b97-af50-ad3d5fcfa32d">
    <name>ФайлКартинки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9f4d4241-b7f9-404c-96be-63c46d087525">
    <name>ШтрихКод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e407a623-3e39-4b3b-abd5-d2d822581628">
    <name>СтратегияОбслуживания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="97b21e2b-4075-4b3f-93d5-4e66ff55ecf2">
    <name>Широта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>20</precision>
          <scale>14</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="63b57671-dba7-4a9b-b406-75124f7407c2">
    <name>Долгота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>20</precision>
          <scale>14</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c7036b49-7b66-497d-a122-8cac8c0e7fd9">
    <name>Высота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="99b876ea-2a2a-4f0e-9d42-e4fb5ff631da">
    <name>ТипОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f0e35030-1cc6-4122-be4c-227beecb8c28">
    <name>ТекСтатусВУчете</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6b745f16-26f4-4412-a0a1-69e4d7952bb0">
    <name>гкс_ОсновноеСредство</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1f797d16-918d-40e5-946e-e228860a3bf8">
    <name>гкс_КатегорияРиска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

Project/Toir.Adaptation/src/CommonModules/гкс_ПроверкаФункциональныхМест/Module.bsl
&ИзменениеИКонтроль("торо_ПроверкаОборудованияНаФункциональныхМестах")
Процедура гкс_торо_ПроверкаОборудованияНаФункциональныхМестах()
	Если Константы.торо_ИспользоватьФункциональныеМеста.Получить() = Ложь Тогда 
		Возврат;
	КонецЕсли;
	СобытиеФМ = Константы.торо_ПараметрыОповещенияОПроверкеОборудованияНаФМ.Получить();
	Если ЗначениеЗаполнено(СобытиеФМ) = Ложь Тогда 
		Возврат;
	КонецЕсли;

	ЗапросТекст = 
	"ВЫБРАТЬ
	|	торо_ОбъектыДляПроверкиТребованийФМ.Объект КАК Ссылка,
	|	торо_ОбъектыДляПроверкиТребованийФМ.Объект.ТипОбъекта 
	|	= ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто) КАК ЭтоФМ,
	|	ТИПЗНАЧЕНИЯ(торо_ОбъектыДляПроверкиТребованийФМ.Объект.Ссылка) = ТИП(Справочник.торо_ОбъектыРемонта) КАК ЭтоОР,
	|	торо_ОбъектыДляПроверкиТребованийФМ.Объект.ТиповойОР КАК ТОР
	|ПОМЕСТИТЬ ЭтиНужноПроверить1
	|ИЗ
	|	РегистрСведений.торо_ОбъектыДляПроверкиТребованийФМ КАК торо_ОбъектыДляПроверкиТребованийФМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_УчетКонтролируемыхПоказателейПоказатели.ОбъектРемонта КАК ОР,
	|	торо_УчетКонтролируемыхПоказателейПоказатели.ОбъектРемонта.ТиповойОР КАК ТОР,
	|	торо_УчетКонтролируемыхПоказателейПоказатели.ОбъектРемонта.ТипОбъекта 
	|	= ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто) КАК ЭтоФМ,
	|	ИСТИНА КАК ЭтоОР,
	|	торо_ДокументыДляПроверкиТребованийФМ.ПроверяемыйДокумент КАК Док
	|ПОМЕСТИТЬ ЭтиНужноПроверить2
	|ИЗ
	|	РегистрСведений.торо_ДокументыДляПроверкиТребованийФМ КАК торо_ДокументыДляПроверкиТребованийФМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_УчетКонтролируемыхПоказателей.Показатели 
	|	КАК торо_УчетКонтролируемыхПоказателейПоказатели
	|		ПО торо_ДокументыДляПроверкиТребованийФМ.ПроверяемыйДокумент = торо_УчетКонтролируемыхПоказателейПоказатели.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтиНужноПроверить.Ссылка КАК Ссылка,
	|	ЭтиНужноПроверить.ЭтоФМ КАК ЭтоФМ,
	|	ЭтиНужноПроверить.ЭтоОР КАК ЭтоОР,
	|	ЭтиНужноПроверить.ТОР КАК ТОР,
	|	NULL КАК ОР
	|ПОМЕСТИТЬ ЭтиНужноПроверить
	|ИЗ
	|	ЭтиНужноПроверить1 КАК ЭтиНужноПроверить
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	ЭтиНужноПроверить2.ЭтоФМ,
	|	ЭтиНужноПроверить2.ЭтоОР,
	|	ЭтиНужноПроверить2.ТОР,
	|	ЭтиНужноПроверить2.ОР
	|ИЗ
	|	ЭтиНужноПроверить2 КАК ЭтиНужноПроверить2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтиНужноПроверить.Ссылка КАК Ссылка,
	|	NULL КАК ОР
	|ПОМЕСТИТЬ ТолькоОР
	|ИЗ
	|	ЭтиНужноПроверить КАК ЭтиНужноПроверить
	|ГДЕ
	|	ЭтиНужноПроверить.ЭтоФМ = ЛОЖЬ
	|	И ЭтиНужноПроверить.ЭтоОР = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ОбъектыРемонта.Ссылка,
	|	NULL
	|ИЗ
	|	ЭтиНужноПроверить КАК ЭтиНужноПроверить
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|		ПО ЭтиНужноПроверить.Ссылка = торо_ОбъектыРемонта.ТиповойОР
	|ГДЕ
	|	ЭтиНужноПроверить.ЭтоОР = ЛОЖЬ
	|	И ЭтиНужноПроверить.ЭтоФМ = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтиНужноПроверить.Ссылка КАК ФМ,
	|	ЭтиНужноПроверить.ТОР КАК ТОР,
	|	ИСТИНА КАК ПроверитьВсе
	|ПОМЕСТИТЬ ВсеФМ
	|ИЗ
	|	ЭтиНужноПроверить КАК ЭтиНужноПроверить
	|ГДЕ
	|	ЭтиНужноПроверить.ЭтоФМ = ИСТИНА
	|	И ЭтиНужноПроверить.ЭтоОР = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ОбъектыРемонта.Ссылка,
	|	торо_ОбъектыРемонта.ТиповойОР,
	|	ИСТИНА
	|ИЗ
	|	ЭтиНужноПроверить КАК ЭтиНужноПроверить
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|		ПО ЭтиНужноПроверить.Ссылка = торо_ОбъектыРемонта.ТиповойОР
	|ГДЕ
	|	ЭтиНужноПроверить.ЭтоФМ = ИСТИНА
	|	И ЭтиНужноПроверить.ЭтоОР = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РегистрОР.РодительИерархии,
	|	РегистрОР.РодительИерархии.ТиповойОР,
	|	ЛОЖЬ
	|ИЗ
	|	ЭтиНужноПроверить КАК ЭтиНужноПроверить
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК РегистрОР
	|		ПО ЭтиНужноПроверить.Ссылка = РегистрОР.ОбъектИерархии
	|			И (РегистрОР.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто))
	|ГДЕ
	|	ЭтиНужноПроверить.ЭтоФМ = ЛОЖЬ
	|	И ЭтиНужноПроверить.ЭтоОР = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РегистрОР.РодительИерархии,
	|	РегистрОР.РодительИерархии.ТиповойОР,
	|	ЛОЖЬ
	|ИЗ
	|	ЭтиНужноПроверить КАК ЭтиНужноПроверить
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК РегистрОР
	|			ПО торо_ОбъектыРемонта.Ссылка = РегистрОР.ОбъектИерархии
	|				И (РегистрОР.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто))
	|		ПО ЭтиНужноПроверить.Ссылка = торо_ОбъектыРемонта.ТиповойОР
	|ГДЕ
	|	ЭтиНужноПроверить.ЭтоОР = ЛОЖЬ
	|	И ЭтиНужноПроверить.ЭтоФМ = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РегистрОР.РодительИерархии,
	|	РегистрОР.РодительИерархии.ТиповойОР,
	|	ЛОЖЬ
	|ИЗ
	|	ЭтиНужноПроверить КАК ЭтиНужноПроверить
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних КАК РегистрОР
	|		ПО ЭтиНужноПроверить.Ссылка = РегистрОР.ОбъектИерархии
	|			И (РегистрОР.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто))
	|ГДЕ
	|	ЭтиНужноПроверить.ЭтоФМ = ЛОЖЬ
	|	И ЭтиНужноПроверить.ЭтоОР = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РегистрОР.РодительИерархии,
	|	РегистрОР.РодительИерархии.ТиповойОР,
	|	ЛОЖЬ
	|ИЗ
	|	ЭтиНужноПроверить КАК ЭтиНужноПроверить
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних КАК РегистрОР
	|			ПО торо_ОбъектыРемонта.Ссылка = РегистрОР.ОбъектИерархии
	|				И (РегистрОР.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто))
	|		ПО ЭтиНужноПроверить.Ссылка = торо_ОбъектыРемонта.ТиповойОР
	|ГДЕ
	|	ЭтиНужноПроверить.ЭтоОР = ЛОЖЬ
	|	И ЭтиНужноПроверить.ЭтоФМ = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеФМ.ФМ КАК ФМ,
	|	ВсеФМ.ТОР КАК ТОР,
	|	МАКСИМУМ(ВсеФМ.ПроверитьВсе) КАК ПроверитьВсе
	|ПОМЕСТИТЬ ФМТОР
	|ИЗ
	|	ВсеФМ КАК ВсеФМ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеФМ.ФМ,
	|	ВсеФМ.ТОР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ТиповыеОРОграниченияНаХарактеристикиОборудования.Ограничение КАК Ограничение,
	|	торо_ТиповыеОРОграниченияНаХарактеристикиОборудования.Иерархия КАК Иерархия,
	|	ФМТОР.ФМ КАК ФМ,
	|	ЛОЖЬ КАК гкс_Удален
	|ПОМЕСТИТЬ ВсеОграничения
	|ИЗ
	|	ФМТОР КАК ФМТОР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.ОграниченияНаХарактеристикиОборудования 
	|	КАК торо_ТиповыеОРОграниченияНаХарактеристикиОборудования
	|		ПО ФМТОР.ТОР = торо_ТиповыеОРОграниченияНаХарактеристикиОборудования.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ОграниченияНаХарактеристикиОборудования.Ограничение,
	|	торо_ОграниченияНаХарактеристикиОборудования.Иерархия,
	|	ФМТОР.ФМ,
	|	торо_ОграниченияНаХарактеристикиОборудования.гкс_Удален
	|ИЗ
	|	ФМТОР КАК ФМТОР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОграниченияНаХарактеристикиОборудования КАК торо_ОграниченияНаХарактеристикиОборудования
	|		ПО ФМТОР.ФМ = торо_ОграниченияНаХарактеристикиОборудования.ФункциональноеМесто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеОграничения.Ограничение КАК Ограничение,
	|	ВсеОграничения.Иерархия КАК Иерархия,
	|	ВсеОграничения.ФМ КАК ФМ,
	|	МАКСИМУМ(ВсеОграничения.гкс_Удален) КАК гкс_Удален
	|ПОМЕСТИТЬ СхлопнутыеОграничения
	|ИЗ
	|	ВсеОграничения КАК ВсеОграничения
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеОграничения.Ограничение,
	|	ВсеОграничения.Иерархия,
	|	ВсеОграничения.ФМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РегистрОР.ОбъектИерархии КАК ОР,
	|	РегистрОР.СтруктураИерархии КАК СтруктураИерархии,
	|	РегистрОР.ОбъектИерархии.ТиповойОР КАК ТОР
	|ПОМЕСТИТЬ ВсеОР
	|ИЗ
	|	ФМТОР КАК ФМТОР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК РегистрОР
	|		ПО ФМТОР.ФМ = РегистрОР.РодительИерархии
	|			И (ФМТОР.ПроверитьВсе
	|				ИЛИ РегистрОР.ОбъектИерархии В
	|					(ВЫБРАТЬ
	|						ТЧ.Ссылка
	|					ИЗ
	|						ТолькоОР КАК ТЧ))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РегистрОР.ОбъектИерархии,
	|	РегистрОР.СтруктураИерархии,
	|	РегистрОР.ОбъектИерархии.ТиповойОР
	|ИЗ
	|	ФМТОР КАК ФМТОР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних КАК РегистрОР
	|		ПО ФМТОР.ФМ = РегистрОР.РодительИерархии
	|			И (РегистрОР.Удален = ЛОЖЬ)
	|			И (ФМТОР.ПроверитьВсе
	|				ИЛИ РегистрОР.ОбъектИерархии В
	|					(ВЫБРАТЬ
	|						ТЧ.Ссылка
	|					ИЗ
	|						ТолькоОР КАК ТЧ))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СхлопнутыеОграничения.Ограничение КАК Ограничение,
	|	ВсеОР.СтруктураИерархии КАК СтруктураИерархии,
	|	ВсеОР.ОР КАК ОР,
	|	СхлопнутыеОграничения.ФМ КАК ФМ
	|ПОМЕСТИТЬ ОграниченияОР
	|ИЗ
	|	СхлопнутыеОграничения КАК СхлопнутыеОграничения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеОР КАК ВсеОР
	|		ПО (СхлопнутыеОграничения.Иерархия = ВсеОР.СтруктураИерархии
	|				ИЛИ СхлопнутыеОграничения.Иерархия = ЗНАЧЕНИЕ(Справочник.торо_СтруктурыОР.ПустаяСсылка))
	|			И (СхлопнутыеОграничения.гкс_Удален = ЛОЖЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ЗначенияКонтролируемыхПоказателейСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ЗначенияКонтролируемыхПоказателейСрезПоследних.Показатель КАК Показатель,
	|	торо_ЗначенияКонтролируемыхПоказателейСрезПоследних.Значение КАК Значение,
	|	торо_ЗначенияКонтролируемыхПоказателейСрезПоследних.ДатаКонтроля КАК ДатаКонтроля
	|ПОМЕСТИТЬ ПоказателиОР
	|ИЗ
	|	РегистрСведений.торо_ЗначенияКонтролируемыхПоказателей.СрезПоследних(
	|			,
	|			ОбъектРемонта В
	|				(ВЫБРАТЬ
	|					ТЧ.ОР
	|				ИЗ
	|					ВсеОР КАК ТЧ)) КАК торо_ЗначенияКонтролируемыхПоказателейСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказателиОР.ОбъектРемонта КАК ОбъектРемонта,
	|	ПоказателиОР.Показатель КАК Показатель,
	|	МАКСИМУМ(ПоказателиОР.ДатаКонтроля) КАК ДатаКонтроля
	|ПОМЕСТИТЬ ПоказателиОРМаксимум
	|ИЗ
	|	ПоказателиОР КАК ПоказателиОР
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоказателиОР.ОбъектРемонта,
	|	ПоказателиОР.Показатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказателиОР.ОбъектРемонта КАК ОбъектРемонта,
	|	ПоказателиОР.Показатель КАК Показатель,
	|	ПоказателиОР.Значение КАК Значение
	|ПОМЕСТИТЬ ПоказателиОРСрез
	|ИЗ
	|	ПоказателиОР КАК ПоказателиОР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоказателиОРМаксимум КАК ПоказателиОРМаксимум
	|		ПО ПоказателиОР.ОбъектРемонта = ПоказателиОРМаксимум.ОбъектРемонта
	|			И ПоказателиОР.Показатель = ПоказателиОРМаксимум.Показатель
	|			И ПоказателиОР.ДатаКонтроля = ПоказателиОРМаксимум.ДатаКонтроля
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеОР.ТОР КАК ТОР,
	|	торо_ТиповыеОРДополнительныеРеквизиты.Свойство КАК Свойство,
	|	торо_ТиповыеОРДополнительныеРеквизиты.Значение КАК Значение,
	|	ВсеОР.ОР КАК ОР
	|ПОМЕСТИТЬ РеквизитыТОР
	|ИЗ
	|	ВсеОР КАК ВсеОР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.ДополнительныеРеквизиты КАК торо_ТиповыеОРДополнительныеРеквизиты
	|		ПО ВсеОР.ТОР = торо_ТиповыеОРДополнительныеРеквизиты.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений.ВидСравнения КАК ВидСравнения,
	|	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений.Значение КАК Значение,
	|	ОграниченияОР.ОР КАК ОР,
	|	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений.Характеристика КАК Характеристика,
	|	ОграниченияОР.ФМ КАК ФМ
	|ПОМЕСТИТЬ ОграниченияРеквизиты
	|ИЗ
	|	ОграниченияОР КАК ОграниченияОР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОграниченияНаХарактеристикиОбрудования.СписокОграничений КАК торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений
	|		ПО ОграниченияОР.Ограничение = торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОграниченияОР.ОР КАК ОР,
	|	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели.Характеристика КАК Характеристика,
	|	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели.ВидСравнения КАК ВидСравнения,
	|	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели.Значение КАК Значение,
	|	ОграниченияОР.ФМ КАК ФМ
	|ПОМЕСТИТЬ ОграниченияПоказатели
	|ИЗ
	|	ОграниченияОР КАК ОграниченияОР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОграниченияНаХарактеристикиОбрудования.СписокОграниченийПоказатели КАК торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели
	|		ПО ОграниченияОР.Ограничение = торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОграниченияРеквизиты.ВидСравнения КАК ВидСравнения,
	|	ОграниченияРеквизиты.Значение КАК План,
	|	ОграниченияРеквизиты.ОР КАК ОР,
	|	РеквизитыТОР.Значение КАК Факт,
	|	РеквизитыТОР.Свойство КАК Свойство,
	|	ОграниченияРеквизиты.ФМ КАК ФМ,
	|	ОграниченияРеквизиты.ФМ.Подразделение КАК Подразделение
	|ИЗ
	|	ОграниченияРеквизиты КАК ОграниченияРеквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РеквизитыТОР КАК РеквизитыТОР
	|		ПО ОграниченияРеквизиты.ОР = РеквизитыТОР.ОР
	|			И ОграниченияРеквизиты.Характеристика = РеквизитыТОР.Свойство
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОграниченияПоказатели.ВидСравнения,
	|	ОграниченияПоказатели.Значение,
	|	ОграниченияПоказатели.ОР,
	|	ПоказателиОР.Значение,
	|	ПоказателиОР.Показатель,
	|	ОграниченияПоказатели.ФМ,
	|	ОграниченияПоказатели.ФМ.Подразделение
	|ИЗ
	|	ОграниченияПоказатели КАК ОграниченияПоказатели
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоказателиОРСрез КАК ПоказателиОР
	|		ПО ОграниченияПоказатели.Характеристика = ПоказателиОР.Показатель
	|			И ОграниченияПоказатели.ОР = ПоказателиОР.ОбъектРемонта
	|ИТОГИ
	|	МАКСИМУМ(ФМ)
	|ПО
	|	ОР";
	МВТ = Новый МенеджерВременныхТаблиц();
	Результат = ПроверитьОграниченияМассиваОР(,, ЗапросТекст, МВТ);

	Если Не Результат = Неопределено Тогда 
		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = МВТ;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтиНужноПроверить.Ссылка КАК Ссылка
		|ИЗ
		|	ЭтиНужноПроверить1 КАК ЭтиНужноПроверить
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭтиНужноПроверить.Док КАК Док
		|ИЗ
		|	ЭтиНужноПроверить2 КАК ЭтиНужноПроверить";
		РезультатЗапроса = Запрос.ВыполнитьПакет();

		Выборка = РезультатЗапроса[0].Выбрать();
		Пока Выборка.Следующий() Цикл
			НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ = 
			РегистрыСведений.торо_ОбъектыДляПроверкиТребованийФМ.СоздатьНаборЗаписей();
			НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ.Отбор.Объект.Установить(Выборка.Ссылка);
			НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ.Записать();
		КонецЦикла;

		Выборка = РезультатЗапроса[1].Выбрать();
		Пока Выборка.Следующий() Цикл
			НаборЗаписейРегистраторо_ДокументыДляПроверкиТребованийФМ = 
			РегистрыСведений.торо_ДокументыДляПроверкиТребованийФМ.СоздатьНаборЗаписей();
			НаборЗаписейРегистраторо_ДокументыДляПроверкиТребованийФМ.Отбор.ПроверяемыйДокумент.Установить(Выборка.Док);
			НаборЗаписейРегистраторо_ДокументыДляПроверкиТребованийФМ.Записать();
		КонецЦикла;

		//
		Для Каждого СтрокаМассиваНеподходящихОбъектовРемонта Из Результат.НеПодходят Цикл
			СтруктураДанных = Новый Структура("Ссылка,ОбъектРемонта,ТекстТребований,ФМ,ВидДокумента");
			ЗаполнитьЗначенияСвойств(СтруктураДанных, СтрокаМассиваНеподходящихОбъектовРемонта);
			СтруктураДанных.ОбъектРемонта = СтрокаМассиваНеподходящихОбъектовРемонта.Ссылка;
			#Вставка
			Попытка
				торо_РаботаСУведомлениями.ЗаписатьУведомленияФМ(СтруктураДанных, СобытиеФМ);
			Исключение
				ЗаписьЖурналаРегистрации("РЗ_торо_ПроверкаОборудованияНаФункциональныхМестах", УровеньЖурналаРегистрации.Ошибка,,
				СтрокаМассиваНеподходящихОбъектовРемонта.Ссылка, ОписаниеОшибки());

				НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ = 
				РегистрыСведений.торо_ОбъектыДляПроверкиТребованийФМ.СоздатьНаборЗаписей();
				НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ.Отбор
				.Объект.Установить(СтрокаМассиваНеподходящихОбъектовРемонта.Ссылка);
				НоваяСтрокаНабораЗаписей = НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ.Добавить();
				НоваяСтрокаНабораЗаписей.Объект = СтрокаМассиваНеподходящихОбъектовРемонта.Ссылка;
				НоваяСтрокаНабораЗаписей.Период = ТекущаяДата();
				НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ.Записать();
			КонецПопытки;
			#КонецВставки
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
